app/controllers/api/reviews_controller.rb

    def index
        @reviews = Review.find_by(business_id: params[:business_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."business_id" = $1 LIMIT $2  [["business_id", 2], ["LIMIT", 1]]

    def create
        @review = Review.new(reviews_params)
        if @review.save
---
INSERT INTO "reviews" ("created_at", "updated_at", "body", "price_range", "rating", "user_id", "business_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2021-08-06 17:05:14.607706"], ["updated_at", "2021-08-06 17:05:14.607706"], ["body", "good"], ["price_range", "$$"], ["rating", 4], ["user_id", 1], ["business_id", 13]]