app/views/api/businesses/show.json.jbuilder

SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = $1  [["business_id", 11]]
---

@business.reviews.includes(:author).each do |review|